Repository: code4romania/teacher-workout-ios
Catalog: Teacher Workout/Localization/Localizable.xcstrings
Source language: en
Languages: ro

# Authentication.alreadyHaveAccountLabel
source: Already have an account?
ro: Ai deja cont?

# Authentication.Email.invalidEmailMessage
source: Invalid email address.
ro: Adresa de e-mail introdusă este invalidă.

# Authentication.Password.inputConfirmLabel
source: Repeat Password
ro: Repetă parola

# Authentication.Password.inputLabel
source: Password
ro: Parola

# Authentication.Password.inputPlaceholder
source: password
ro: parola

# Authentication.Password.invalidMessage
source: Your password should contain at least 1 lowercase letter, an uppercase letter, a number and it should be between 8-15 characters long.
ro: Parola trebuie să conțină cel puțin o literă mică, o literă majusculă, un număr și să aibă o lungime între 8 și 5 caractere.

# Authentication.signInButtonTitle
source: Sign In
ro: Autentifică-te

# Authentication.signInForgotPasswordLabel
source: Forgot password?
ro: Ți-ai uitat parola?

# Authentication.signInIntro
source: Sign In
ro: Autentifică-te

# Authentication.signUpButtonTitle
source: Sign Up
ro: înregistrează-te

# Authentication.signUpIntro
source: Sign Up
ro: Creează-ți contul

# Authentication.termsAndConditionsLabel
source: I agree with the terms and conditions
ro: Sunt de acord cu termenii și condițiile acestei aplicații GDPR și alte detalii

source: CANCEL
ro: RENUNȚĂ

# ChangePassword.confirmPasswordError
source: Password does not match.
ro: Parola nu coincide.

# ChangePassword.confirmPasswordLabel
source: Confirm password
ro: Reintrodu parola

# ChangePassword.ctaButtonTitle
source: Save new password
ro: Salvează parola nouă

# ChangePassword.navigationTitle
source: Change password
ro: Schimbă parola

# ChangePassword.newPasswordLabel
source: New password
ro: Parola nouă

# ChangePassword.sectionLabel
source: Change password
ro: Schimbă parola

# Discover.listDescription
source: Lesson categories
ro: Categorii de lecții

# Discover.navigationTitle
source: Discover lessons
ro: Descoperă lecțiile

# dividerLabel
source: or
ro: sau

# ForgotPassword.confirmationDetails
source: An e-mail for password reset was sent to the entered email address.
ro: Un e-mail pentru resetarea parolei a fost trimis la adresa de e-mail introdusă.

# ForgotPassword.confirmationIntro
source: Check your email
ro: Verifică-ți e-mailul

# ForgotPassword.forgotIntro
source: Reset password
ro: Resetează-ți parola

# ForgotPassword.resetButtonTitle
source: Reset
ro: Resetează

# Home.lessonsInProgress
source: Lessons in progress
ro: Lecții în curs

# Home.navigationTitle
source: Find a lesson
ro: Caută o lecție

# Home.newLessons
source: Newly added lessons
ro: Lecții nou adăugate

# Lesson.continueText
source: Continue
ro: Continuă

# Lesson.Finished.share
source: Share
ro: Partajează

# Lesson.Finished.subtitleText
source: Every day you can become a better teacher for all your students!
ro: În fiecare zi poți deveni un profesor mai bun pentru toți elevii tăi!

# Lesson.Finished.titleText
source: Completed lesson!
ro: Curs complet!

# Lesson.Intro.saveLesson
source: Save lesson
ro: Salvează lecția

# Lesson.Intro.startLesson
source: Start lesson
ro: Începe lecția

# Menu.discover
source: Discover
ro: Descoperă

# Menu.home
source: Home
ro: Acasă

# Menu.profile
source: Profile
ro: Profil

# Onboarding.doneButton
source: Done
ro: Gata

# Onboarding.nextButton
source: Next >
ro: Următorul >

# Profile.resultsTabLabel
source: Results
ro: Rezultate

# Profile.settingsTabLabel
source: Settings
ro: Setări

# Search.cancelButton
source: Cancel
ro: Anulează

# Search.placeholder
source: Find a topic
ro: Caută un subiect

# Settings.changeImage
source: Change profile image
ro: Schimbă fotografie

# Settings.changeImageAlertTitle
source: Do you want to change your profile image?
ro: Vrei să îți schimbi fotografia?

# Settings.changePassword
source: Change password
ro: Schimbă parola

# Settings.deleteAccount
source: Delete account
ro: Șterge cont

# Settings.deleteAccountAlertDescription
source: This action is irreversible. If you delete your account you will lose all your lesson history.
ro: Această acțiune este ireversibilă. Dacă îți ștergi contul vei pierde tot istoricul de lecții.

# Settings.deleteAccountAlertTitle
source: Are you sure that you want to delete your account?
ro: Ești sigur că vrei să îți ștergi contul?

# Settings.logOut
source: Log out
ro: Delogare

# Settings.notifications
source: Notifications
ro: Notificări

# Settings.uploadImage
source: Upload image
ro: Încarcă fotografie
